tap "codecrafters-io/tap"
tap "filosottile/musl-cross"
tap "gromgit/fuse"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
# Zstandard is a real-time compression algorithm
brew "zstd"
# Color management engine supporting ICC profiles
brew "little-cms2"
# FSF/GNU binutils for cross-compiling to arm-linux
brew "arm-linux-gnueabihf-binutils"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Shell extension to jump to frequently used directories
brew "autojump"
# Text processing system for reStructuredText
brew "docutils"
# Official Amazon AWS command-line interface
brew "awscli"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Deduplicating archiver with compression and authenticated encryption
brew "borgbackup"
# Simple wrapper script for the Borg backup software
brew "borgmatic"
# Powerful, enterprise-ready, open source web server with automatic HTTPS
brew "caddy"
# Cross-platform make
brew "cmake"
# Configurable talking characters in ASCII art
brew "cowsay"
# Embeddable SQL OLAP Database Management System
brew "duckdb"
# C library implementing the SSH2 protocol
brew "libssh2"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Modern replacement for 'ls'
brew "exa"
# Asynchronous event library
brew "libevent"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Utility to determine file types
brew "file-formula"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# GNU version of the tar archiving utility
brew "gnu-tar"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Library for manipulating JPEG-2000 images
brew "jasper"
# Image manipulation
brew "netpbm"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU grep, egrep and fgrep
brew "grep"
# GNU troff text-formatting system
brew "groff"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Next-gen compiler infrastructure
brew "llvm"
# Rainbows and unicorns in your console!
brew "lolcat"
# Utility for directing compilation
brew "make"
# Remote terminal application
brew "mosh"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Development kit for the Java programming language
brew "openjdk"
# Drop-in replacement for Terraform. Infrastructure as Code Tool
brew "opentofu"
# Manage compile and link flags for libraries
brew "pkg-config"
# Fast, disk space efficient package manager
brew "pnpm"
# Object-relational database system
brew "postgresql@15", restart_service: true
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Python interface to Tcl/Tk
brew "python-tk@3.11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Persistent key-value database, with built-in net interface
brew "redis"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Modern Day Portscanner
brew "rustscan"
# SMART hard drive monitoring
brew "smartmontools"
# Terminal multiplexer
brew "tmux"
# Collection of Linux utilities
brew "util-linux"
# Syntax-aware linter for prose
brew "vale"
# JavaScript package manager
brew "yarn"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# UNIX shell (command interpreter)
brew "zsh"
# CodeCrafters CLI
brew "codecrafters-io/tap/codecrafters"
# Linux cross compilers based on musl libc
brew "filosottile/musl-cross/musl-cross"
# File system client based on SSH File Transfer Protocol
brew "gromgit/fuse/sshfs-mac"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
# Superfamily of fonts for code
cask "font-monaspace"
# File system integration
cask "macfuse"
# Analysis tool for security research and malware triage
cask "red-canary-mac-monitor"
# Displays all open files and sockets in use by all running processes
cask "sloth"
# System monitor for the menu bar
cask "stats"
vscode "aaron-bond.better-comments"
vscode "activitywatch.aw-watcher-vscode"
vscode "ahmadalli.vscode-nginx-conf"
vscode "akamud.vscode-theme-onedark"
vscode "bradlc.vscode-tailwindcss"
vscode "charliermarsh.ruff"
vscode "chrischinchilla.vale-vscode"
vscode "DavidAnson.vscode-markdownlint"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "Evidence.evidence-vscode"
vscode "GitHub.github-vscode-theme"
vscode "golang.go"
vscode "hangxingliu.vscode-nginx-conf-hint"
vscode "lorenzopirro.rust-flash-snippets"
vscode "matthewpi.caddyfile-support"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.python"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-pg"
vscode "mtxr.sqltools-driver-sqlite"
vscode "naumovs.color-highlight"
vscode "paulober.pico-w-go"
vscode "raynigon.nginx-formatter"
vscode "redhat.vscode-xml"
vscode "ritwickdey.LiveServer"
vscode "rust-lang.rust-analyzer"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "twxs.cmake"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vscode-icons-team.vscode-icons"
vscode "ziglang.vscode-zig"
